#pragma once

// SCUM (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class ConZ.AchievementsManagerClient
// 0x0098 (0x03C0 - 0x0328)
class AAchievementsManagerClient : public AActor
{
public:
	unsigned char                                      UnknownData00[0x98];                                      // 0x0328(0x0098) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AchievementsManagerClient");
		return ptr;
	}

};


// Class ConZ.AchievementsManagerServer
// 0x0078 (0x03A0 - 0x0328)
class AAchievementsManagerServer : public AActor
{
public:
	unsigned char                                      UnknownData00[0x78];                                      // 0x0328(0x0078) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AchievementsManagerServer");
		return ptr;
	}

};


// Class ConZ.DesignableUserWidget
// 0x0018 (0x0220 - 0x0208)
class UDesignableUserWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0208(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.DesignableUserWidget");
		return ptr;
	}


	void SetDisplayLabelName(const struct FString& displayLabelName);
	void SetDefaultPosition(const struct FVector2D& Value);
	void OnSynchronizeProperties();
	struct FString GetDisplayLabelName();
	struct FVector2D GetDefaultPosition();
};


// Class ConZ.ActionProgressWidget
// 0x0050 (0x0270 - 0x0220)
class UActionProgressWidget : public UDesignableUserWidget
{
public:
	struct FScriptMulticastDelegate                    ActionProgressFinishedEvent;                              // 0x0220(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    ActionProgressCancelledEvent;                             // 0x0230(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               CanCancel;                                                // 0x0240(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xB];                                       // 0x0241(0x000B) MISSED OFFSET
	float                                              _currentTime;                                             // 0x024C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              _duration;                                                // 0x0250(0x0004) (Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               _manualMode;                                              // 0x0254(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1B];                                      // 0x0255(0x001B) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.ActionProgressWidget");
		return ptr;
	}


	void UnPauseProgress();
	void SetProgress(float progress);
	void PauseProgress();
	void OnActionProgressFinishedEvent__DelegateSignature();
	void OnActionProgressCancelledEvent__DelegateSignature();
	void ExecuteAction();
	void CancelAction();
};


// Class ConZ.Sickness
// 0x0188 (0x01B0 - 0x0028)
class USickness : public UObject
{
public:
	unsigned char                                      UnknownData00[0x188];                                     // 0x0028(0x0188) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.Sickness");
		return ptr;
	}


	void SetShouldDisplayState(bool Value);
	ESicknessState GetState();
	bool GetShouldDisplayState();
	int GetPhase();
	struct FText GetCaption();
};


// Class ConZ.Addiction
// 0x0000 (0x01B0 - 0x01B0)
class UAddiction : public USickness
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.Addiction");
		return ptr;
	}

};


// Class ConZ.AdminCommand
// 0x0058 (0x0080 - 0x0028)
class UAdminCommand : public UObject
{
public:
	struct FString                                     _verb;                                                    // 0x0028(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FAdminCommandArgumentDescription>    _argumentDescriptions;                                    // 0x0038(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	int                                                _numberOfRequiredArguments;                               // 0x0048(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               _isEnabled;                                               // 0x004C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               _isEnabledInShippingBuild;                                // 0x004D(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               _isAdminStatusRequired;                                   // 0x004E(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               _isDeveloperStatusRequired;                               // 0x004F(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               _shouldExecuteOnServer;                                   // 0x0050(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               _shouldExecuteOnClient;                                   // 0x0051(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               _shouldDisableSingleplayerAchievementsIfExecuted;         // 0x0052(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x0053(0x0005) MISSED OFFSET
	struct FString                                     _description;                                             // 0x0058(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData01[0x18];                                      // 0x0068(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand");
		return ptr;
	}


	bool Execute(TArray<struct FString> Arguments);
	bool CanEverBeExecuted(class APlayerController* Controller, struct FString* reasonIfNot);
	bool CanBeExecuted(class APlayerController* Controller, struct FString* reasonIfNot);
};


// Class ConZ.AdminCommand_Announce
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_Announce : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_Announce");
		return ptr;
	}

};


// Class ConZ.AdminCommand_BanPlayer
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_BanPlayer : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_BanPlayer");
		return ptr;
	}

};


// Class ConZ.AdminCommand_CharacterSpawner
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_CharacterSpawner : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_CharacterSpawner");
		return ptr;
	}

};


// Class ConZ.AdminCommand_CompleteMission
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_CompleteMission : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_CompleteMission");
		return ptr;
	}

};


// Class ConZ.AdminCommand_CrashMajestically
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_CrashMajestically : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_CrashMajestically");
		return ptr;
	}

};


// Class ConZ.AdminCommand_DemolitionSkillDebug
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_DemolitionSkillDebug : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_DemolitionSkillDebug");
		return ptr;
	}

};


// Class ConZ.AdminCommand_DestroyAllVehicles
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_DestroyAllVehicles : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_DestroyAllVehicles");
		return ptr;
	}

};


// Class ConZ.AdminCommand_DestroyVehicle
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_DestroyVehicle : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_DestroyVehicle");
		return ptr;
	}

};


// Class ConZ.AdminCommand_Immortality
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_Immortality : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_Immortality");
		return ptr;
	}

};


// Class ConZ.AdminCommand_KickPlayer
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_KickPlayer : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_KickPlayer");
		return ptr;
	}

};


// Class ConZ.AdminCommand_Knockout
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_Knockout : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_Knockout");
		return ptr;
	}

};


// Class ConZ.AdminCommand_LeaveCorpse
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_LeaveCorpse : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_LeaveCorpse");
		return ptr;
	}

};


// Class ConZ.AdminCommand_ListMutedPlayers
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_ListMutedPlayers : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_ListMutedPlayers");
		return ptr;
	}

};


// Class ConZ.AdminCommand_ListPlayers
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_ListPlayers : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_ListPlayers");
		return ptr;
	}

};


// Class ConZ.AdminCommand_ListPrimaryAssets
// 0x0058 (0x00D8 - 0x0080)
class UAdminCommand_ListPrimaryAssets : public UAdminCommand
{
public:
	struct FPrimaryAssetType                           _primaryAssetType;                                        // 0x0080(0x0008) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x50];                                      // 0x0088(0x0050) UNKNOWN PROPERTY: SetProperty ConZ.AdminCommand_ListPrimaryAssets._primaryAssetsToExclude

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_ListPrimaryAssets");
		return ptr;
	}

};


// Class ConZ.AdminCommand_ListSpawnedVehicles
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_ListSpawnedVehicles : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_ListSpawnedVehicles");
		return ptr;
	}

};


// Class ConZ.AdminCommand_ListSquadMembers
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_ListSquadMembers : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_ListSquadMembers");
		return ptr;
	}

};


// Class ConZ.AdminCommand_ListSquads
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_ListSquads : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_ListSquads");
		return ptr;
	}

};


// Class ConZ.AdminCommand_Location
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_Location : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_Location");
		return ptr;
	}

};


// Class ConZ.AdminCommand_MutePlayer
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_MutePlayer : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_MutePlayer");
		return ptr;
	}

};


// Class ConZ.AdminCommand_PlaceableActorDebug
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_PlaceableActorDebug : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_PlaceableActorDebug");
		return ptr;
	}

};


// Class ConZ.AdminCommand_ResetAchievements
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_ResetAchievements : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_ResetAchievements");
		return ptr;
	}

};


// Class ConZ.AdminCommand_ResetMissionEnabled
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_ResetMissionEnabled : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_ResetMissionEnabled");
		return ptr;
	}

};


// Class ConZ.AdminCommand_ResetSquadInfo
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_ResetSquadInfo : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_ResetSquadInfo");
		return ptr;
	}

};


// Class ConZ.AdminCommand_ScheduleWorldEvent
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_ScheduleWorldEvent : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_ScheduleWorldEvent");
		return ptr;
	}

};


// Class ConZ.AdminCommand_SetDecayTimeDilation
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_SetDecayTimeDilation : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_SetDecayTimeDilation");
		return ptr;
	}

};


// Class ConZ.AdminCommand_SetFacialHairLength
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_SetFacialHairLength : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_SetFacialHairLength");
		return ptr;
	}

};


// Class ConZ.AdminCommand_SetFamePoints
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_SetFamePoints : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_SetFamePoints");
		return ptr;
	}

};


// Class ConZ.AdminCommand_SetFamePointsToAll
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_SetFamePointsToAll : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_SetFamePointsToAll");
		return ptr;
	}

};


// Class ConZ.AdminCommand_SetFamePointsToAllOnline
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_SetFamePointsToAllOnline : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_SetFamePointsToAllOnline");
		return ptr;
	}

};


// Class ConZ.AdminCommand_SetGodMode
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_SetGodMode : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_SetGodMode");
		return ptr;
	}

};


// Class ConZ.AdminCommand_SetHairLength
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_SetHairLength : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_SetHairLength");
		return ptr;
	}

};


// Class ConZ.AdminCommand_SetInfiniteAmmo
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_SetInfiniteAmmo : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_SetInfiniteAmmo");
		return ptr;
	}

};


// Class ConZ.AdminCommand_SetInfiniteStamina
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_SetInfiniteStamina : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_SetInfiniteStamina");
		return ptr;
	}

};


// Class ConZ.AdminCommand_SetSkillLevel
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_SetSkillLevel : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_SetSkillLevel");
		return ptr;
	}

};


// Class ConZ.AdminCommand_SetStamina
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_SetStamina : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_SetStamina");
		return ptr;
	}

};


// Class ConZ.AdminCommand_SetTime
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_SetTime : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_SetTime");
		return ptr;
	}

};


// Class ConZ.AdminCommand_SetWeather
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_SetWeather : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_SetWeather");
		return ptr;
	}

};


// Class ConZ.AdminCommand_ShowBaseBuildingDebug
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_ShowBaseBuildingDebug : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_ShowBaseBuildingDebug");
		return ptr;
	}

};


// Class ConZ.AdminCommand_Sleep
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_Sleep : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_Sleep");
		return ptr;
	}

};


// Class ConZ.AdminCommand_SpawnPrimaryActorAsset
// 0x0060 (0x00E0 - 0x0080)
class UAdminCommand_SpawnPrimaryActorAsset : public UAdminCommand
{
public:
	struct FPrimaryAssetType                           _primaryAssetType;                                        // 0x0080(0x0008) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x50];                                      // 0x0088(0x0050) UNKNOWN PROPERTY: SetProperty ConZ.AdminCommand_SpawnPrimaryActorAsset._primaryAssetsToExclude
	int                                                _countArgumentMinValue;                                   // 0x00D8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                _countArgumentMaxValue;                                   // 0x00DC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_SpawnPrimaryActorAsset");
		return ptr;
	}

};


// Class ConZ.AdminCommand_SpawnRandomPrimaryActorAsset
// 0x0000 (0x00E0 - 0x00E0)
class UAdminCommand_SpawnRandomPrimaryActorAsset : public UAdminCommand_SpawnPrimaryActorAsset
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_SpawnRandomPrimaryActorAsset");
		return ptr;
	}

};


// Class ConZ.AdminCommand_Teleport
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_Teleport : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_Teleport");
		return ptr;
	}

};


// Class ConZ.AdminCommand_TeleportTo
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_TeleportTo : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_TeleportTo");
		return ptr;
	}

};


// Class ConZ.AdminCommand_TeleportTo3pm
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_TeleportTo3pm : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_TeleportTo3pm");
		return ptr;
	}

};


// Class ConZ.AdminCommand_TeleportToMe
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_TeleportToMe : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_TeleportToMe");
		return ptr;
	}

};


// Class ConZ.AdminCommand_TeleportToVehicle
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_TeleportToVehicle : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_TeleportToVehicle");
		return ptr;
	}

};


// Class ConZ.AdminCommand_UnbanPlayer
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_UnbanPlayer : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_UnbanPlayer");
		return ptr;
	}

};


// Class ConZ.AdminCommand_UnmutePlayer
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_UnmutePlayer : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_UnmutePlayer");
		return ptr;
	}

};


// Class ConZ.AdminCommand_VisualizeBulletTrajectories
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_VisualizeBulletTrajectories : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_VisualizeBulletTrajectories");
		return ptr;
	}

};


// Class ConZ.AdminCommand_VisualizeZombieLocation
// 0x0000 (0x0080 - 0x0080)
class UAdminCommand_VisualizeZombieLocation : public UAdminCommand
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommand_VisualizeZombieLocation");
		return ptr;
	}

};


// Class ConZ.AdminCommandArgumentCompletion
// 0x0008 (0x0030 - 0x0028)
class UAdminCommandArgumentCompletion : public UObject
{
public:
	bool                                               _canCompletionValuesBeCached;                             // 0x0028(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommandArgumentCompletion");
		return ptr;
	}


	void GetCompletionValues(TArray<struct FString>* Result);
};


// Class ConZ.AdminCommandArgumentCompletion_Constant
// 0x0010 (0x0040 - 0x0030)
class UAdminCommandArgumentCompletion_Constant : public UAdminCommandArgumentCompletion
{
public:
	TArray<struct FString>                             _completionValues;                                        // 0x0030(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommandArgumentCompletion_Constant");
		return ptr;
	}

};


// Class ConZ.AdminCommandArgumentCompletion_Enum
// 0x0060 (0x0090 - 0x0030)
class UAdminCommandArgumentCompletion_Enum : public UAdminCommandArgumentCompletion
{
public:
	struct FName                                       _enum;                                                    // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               _excludeNoneEnumerator;                                   // 0x0038(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               _excludeAutoGeneratedEnumerator;                          // 0x0039(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x003A(0x0006) MISSED OFFSET
	unsigned char                                      UnknownData01[0x50];                                      // 0x003A(0x0050) UNKNOWN PROPERTY: SetProperty ConZ.AdminCommandArgumentCompletion_Enum._additionalEnumeratorsToExclude

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommandArgumentCompletion_Enum");
		return ptr;
	}

};


// Class ConZ.AdminCommandArgumentCompletion_Player
// 0x0000 (0x0030 - 0x0030)
class UAdminCommandArgumentCompletion_Player : public UAdminCommandArgumentCompletion
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommandArgumentCompletion_Player");
		return ptr;
	}

};


// Class ConZ.AdminCommandArgumentCompletion_PrimaryAsset
// 0x0058 (0x0088 - 0x0030)
class UAdminCommandArgumentCompletion_PrimaryAsset : public UAdminCommandArgumentCompletion
{
public:
	struct FPrimaryAssetType                           _primaryAssetType;                                        // 0x0030(0x0008) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x50];                                      // 0x0038(0x0050) UNKNOWN PROPERTY: SetProperty ConZ.AdminCommandArgumentCompletion_PrimaryAsset._primaryAssetsToExclude

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommandArgumentCompletion_PrimaryAsset");
		return ptr;
	}

};


// Class ConZ.AdminCommandArgumentCompletion_Skill
// 0x0000 (0x0030 - 0x0030)
class UAdminCommandArgumentCompletion_Skill : public UAdminCommandArgumentCompletion
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommandArgumentCompletion_Skill");
		return ptr;
	}

};


// Class ConZ.AdminCommandArgumentCompletion_Squad
// 0x0000 (0x0030 - 0x0030)
class UAdminCommandArgumentCompletion_Squad : public UAdminCommandArgumentCompletion
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommandArgumentCompletion_Squad");
		return ptr;
	}

};


// Class ConZ.AdminCommandCompletionManager
// 0x00B0 (0x00D8 - 0x0028)
class UAdminCommandCompletionManager : public UObject
{
public:
	TMap<struct FString, class UClass*>                _commands;                                                // 0x0028(0x0050) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x60];                                      // 0x0078(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommandCompletionManager");
		return ptr;
	}

};


// Class ConZ.AdminCommandRegistry
// 0x0060 (0x0088 - 0x0028)
class UAdminCommandRegistry : public UObject
{
public:
	TArray<class UClass*>                              _commands;                                                // 0x0028(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x50];                                      // 0x0038(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AdminCommandRegistry");
		return ptr;
	}


	bool UnregisterCommand(class UClass* Command);
	void UnregisterAllCommands();
	bool RegisterCommand(class UClass* Command);
	bool IsCommandRegistered(class UClass* Command);
	TArray<class UClass*> GetCommands();
	class UClass* GetCommandByVerb(const struct FString& verb);
};


// Class ConZ.AlcoholismAddiction
// 0x0010 (0x01C0 - 0x01B0)
class UAlcoholismAddiction : public UAddiction
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x01B0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AlcoholismAddiction");
		return ptr;
	}

};


// Class ConZ.Disease
// 0x0000 (0x01B0 - 0x01B0)
class UDisease : public USickness
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.Disease");
		return ptr;
	}

};


// Class ConZ.Poisoning
// 0x0000 (0x01B0 - 0x01B0)
class UPoisoning : public UDisease
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.Poisoning");
		return ptr;
	}

};


// Class ConZ.AmanitaMuscariaPoisoning
// 0x0010 (0x01C0 - 0x01B0)
class UAmanitaMuscariaPoisoning : public UPoisoning
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x01B0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AmanitaMuscariaPoisoning");
		return ptr;
	}

};


// Class ConZ.AmanitaPantheriaPoisoning
// 0x0008 (0x01B8 - 0x01B0)
class UAmanitaPantheriaPoisoning : public UPoisoning
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01B0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AmanitaPantheriaPoisoning");
		return ptr;
	}

};


// Class ConZ.AmanitaPhalloidesPoisoning
// 0x0008 (0x01B8 - 0x01B0)
class UAmanitaPhalloidesPoisoning : public UPoisoning
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01B0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AmanitaPhalloidesPoisoning");
		return ptr;
	}

};


// Class ConZ.AmanitaVirosaPoisoning
// 0x0010 (0x01C0 - 0x01B0)
class UAmanitaVirosaPoisoning : public UPoisoning
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x01B0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AmanitaVirosaPoisoning");
		return ptr;
	}

};


// Class ConZ.Item
// 0x0518 (0x0840 - 0x0328)
class AItem : public AActor
{
public:
	unsigned char                                      UnknownData00[0x88];                                      // 0x0328(0x0088) MISSED OFFSET
	struct FScriptMulticastDelegate                    DebugTextChanged;                                         // 0x03B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    PickedUpState;                                            // 0x03C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnStaticMeshChanged;                                      // 0x03D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnSkeletalMeshChanged;                                    // 0x03E0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnItemAddedEvent;                                         // 0x03F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnItemRemovedEvent;                                       // 0x0400(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnItemMovedEvent;                                         // 0x0410(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0420(0x0010) MISSED OFFSET
	class UClass*                                      AttachmentSocketMountType;                                // 0x0430(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FAttachmentSocket>                   AttachmentSockets;                                        // 0x0438(0x0010) (Edit, ZeroConstructor)
	class UClass*                                      HolsterAttachmentSocketMountType;                         // 0x0448(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TMap<class UClass*, struct FAttachmentSocketOffset> AttachmentSocketsOffset;                                  // 0x0450(0x0050) (Edit, ZeroConstructor)
	class UStaticMeshComponent*                        Mesh;                                                     // 0x04A0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UTexture2D*                                  InventoryIcon;                                            // 0x04A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UTexture2D*                                  InventoryIconInHands;                                     // 0x04B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UTexture2D*                                  OutsideInventoryIcon;                                     // 0x04B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FText                                       Caption;                                                  // 0x04C0(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	uint32_t                                           SizeX;                                                    // 0x04D8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	uint32_t                                           SizeY;                                                    // 0x04DC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               IgnoreMaxContainedWeight;                                 // 0x04E0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x04E1(0x0003) MISSED OFFSET
	float                                              MaxContainedWeight;                                       // 0x04E4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MaxWaterWeightAsRatioOfWeight;                            // 0x04E8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsIgnoredBySpawners;                                      // 0x04EC(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FItemLocation                               ItemLocation;                                             // 0x04ED(0x000E) (Edit, DisableEditOnInstance)
	EItemRarity                                        Rarity;                                                   // 0x04FB(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x04FC(0x0004) MISSED OFFSET
	struct FGameplayTagContainer                       ItemSpawnTypes;                                           // 0x0500(0x0020) (Edit, DisableEditOnInstance)
	struct FVector                                     SpawnLocationOffset;                                      // 0x0520(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    SpawnRotationOffset;                                      // 0x052C(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              SpawnRotationRandomization;                               // 0x0538(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                Uses;                                                     // 0x053C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FText                                       Description;                                              // 0x0540(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<struct FPossibleItemSickness>               PossibleSicknesses;                                       // 0x0558(0x0010) (Edit, ZeroConstructor)
	TArray<class UClass*>                              TreatSicknesses;                                          // 0x0568(0x0010) (Edit, ZeroConstructor)
	float                                              DamageOnUse;                                              // 0x0578(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DamageOverTime;                                           // 0x057C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AutoDestructTime;                                         // 0x0580(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	EItemExhausted                                     IfExhausted;                                              // 0x0584(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	EInteractionType                                   CraftingInteraction;                                      // 0x0585(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x2];                                       // 0x0586(0x0002) MISSED OFFSET
	class UChoppingRecipeDataAsset*                    ChoppingRecipeDataAsset;                                  // 0x0588(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FText                                       PickupCaption;                                            // 0x0590(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               EnableGlowOnBeginPlay;                                    // 0x05A8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               EnableAwarenessGlow;                                      // 0x05A9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               EnableHoverGlow;                                          // 0x05AA(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x5];                                       // 0x05AB(0x0005) MISSED OFFSET
	TArray<class UBaseItemTag*>                        ItemTags;                                                 // 0x05B0(0x0010) (Edit, ZeroConstructor)
	TArray<class UBaseItemTag*>                        OwnedItemTags;                                            // 0x05C0(0x0010) (Edit, ExportObject, ZeroConstructor)
	TArray<struct FString>                             ItemSnapTags;                                             // 0x05D0(0x0010) (Edit, ZeroConstructor)
	EItemNoiseLevel                                    NoiseLevel;                                               // 0x05E0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x7];                                       // 0x05E1(0x0007) MISSED OFFSET
	struct FItemMotionNoise                            MotionNoise;                                              // 0x05E8(0x0008) (Edit)
	struct FItemInventoryHandlingSounds                InventoryHandlingSounds;                                  // 0x05F0(0x0008) (Edit)
	class UDestructibleMesh*                           DestroyedMesh;                                            // 0x05F8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DestroyedImpulseStrength;                                 // 0x0600(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x0604(0x0004) MISSED OFFSET
	class UAkAudioEvent*                               DestroyedSound;                                           // 0x0608(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      HoverWidgetClass;                                         // 0x0610(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x18];                                      // 0x0618(0x0018) MISSED OFFSET
	class UThrowingComponent*                          ThrowingComponent;                                        // 0x0630(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               ShouldDestroyContainedItemsOnDestroyEvent;                // 0x0638(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x48];                                      // 0x0639(0x0048) MISSED OFFSET
	EInteractionType                                   _defaultInteractionOnFloor;                               // 0x0681(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EInteractionType                                   _defaultInteractionInInventory;                           // 0x0682(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EInteractionType                                   _defaultInteractionEquipped;                              // 0x0683(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10[0x14];                                      // 0x0684(0x0014) MISSED OFFSET
	float                                              _itemLoadingWeightOverride;                               // 0x0698(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData11[0x4];                                       // 0x069C(0x0004) MISSED OFFSET
	struct FText                                       _debugText;                                               // 0x06A0(0x0018) (Net)
	class AActor*                                      _attachParentObject;                                      // 0x06B8(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FVisibilityReplication                      _visibilityReplication;                                   // 0x06C0(0x0008) (Net)
	unsigned char                                      UnknownData12[0x14];                                      // 0x06C8(0x0014) MISSED OFFSET
	unsigned char                                      _waterWeightReplicated;                                   // 0x06DC(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData13[0xB];                                       // 0x06DD(0x000B) MISSED OFFSET
	bool                                               _meshIsSimulatingPhysics;                                 // 0x06E8(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData14[0x3];                                       // 0x06E9(0x0003) MISSED OFFSET
	float                                              Fuel;                                                     // 0x06EC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Weight;                                                   // 0x06F0(0x0004) (Edit, Net, ZeroConstructor, IsPlainOldData)
	float                                              _health;                                                  // 0x06F4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              _maxHealth;                                               // 0x06F8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              _defaultMaxHealth;                                        // 0x06FC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	uint16_t                                           _healthReplicated;                                        // 0x0700(0x0002) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData15[0x2];                                       // 0x0702(0x0002) MISSED OFFSET
	float                                              _weightUsed;                                              // 0x0704(0x0004) (Edit, Net, ZeroConstructor, IsPlainOldData)
	bool                                               _isCrafted;                                               // 0x0708(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData16[0x3];                                       // 0x0709(0x0003) MISSED OFFSET
	float                                              _uncraftTime;                                             // 0x070C(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               _isBusy;                                                  // 0x0710(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               _examined;                                                // 0x0711(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData17[0x16];                                      // 0x0712(0x0016) MISSED OFFSET
	class USceneComponent*                             _tempSceneComponent;                                      // 0x0728(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	bool                                               _useHandCorrections;                                      // 0x0730(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               _shouldBeMaintained;                                      // 0x0731(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData18[0xE];                                       // 0x0732(0x000E) MISSED OFFSET
	int64_t                                            _expirationTime;                                          // 0x0740(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               _canBeDropped;                                            // 0x0748(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData19[0x3];                                       // 0x0749(0x0003) MISSED OFFSET
	int                                                _maxNumberOfContainedItems;                               // 0x074C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               _canContainNonEmptyItems;                                 // 0x0750(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               _blinkOnSpawn;                                            // 0x0751(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               _isPartOfEvent;                                           // 0x0752(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData20[0x1];                                       // 0x0753(0x0001) MISSED OFFSET
	float                                              _vicinityCheckDistance;                                   // 0x0754(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              _updateVisualsFrequency;                                  // 0x0758(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData21[0x4];                                       // 0x075C(0x0004) MISSED OFFSET
	struct FTimerHandle                                _updateVisualsTimer;                                      // 0x0760(0x0008)
	TArray<struct FInventoryStackData>                 _stacks;                                                  // 0x0768(0x0010) (Net, ZeroConstructor)
	TArray<class UClass*>                              _stackableClasses;                                        // 0x0778(0x0010) (Edit, ZeroConstructor)
	class AItem*                                       _stackExhaustedSuccessorItem;                             // 0x0788(0x0008) (ZeroConstructor, IsPlainOldData)
	TScriptInterface<class UInventoryContainer>        _parentContainer;                                         // 0x0790(0x0010) (ZeroConstructor, IsPlainOldData)
	TScriptInterface<class UInventoryNode>             _parentInventoryNode;                                     // 0x07A0(0x0010) (ZeroConstructor, IsPlainOldData)
	bool                                               _canEverBeVirtualized;                                    // 0x07B0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               _hasHighLoadPriorityInVirtualization;                     // 0x07B1(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData22[0x2];                                       // 0x07B2(0x0002) MISSED OFFSET
	float                                              _virtualizationDistance;                                  // 0x07B4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               _canPlaceItemsOn;                                         // 0x07B8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               _shouldShowStatusWidget;                                  // 0x07B9(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               _canBeNamed;                                              // 0x07BA(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData23[0x5];                                       // 0x07BB(0x0005) MISSED OFFSET
	TWeakObjectPtr<class UItemStatusWidget>            _itemStatusWidget;                                        // 0x07C0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TWeakObjectPtr<class UChangeTextWidget>            _editTextWidget;                                          // 0x07C8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FString                                     _playerGivenName;                                         // 0x07D0(0x0010) (Net, ZeroConstructor)
	unsigned char                                      UnknownData24[0x10];                                      // 0x07E0(0x0010) MISSED OFFSET
	float                                              _preferredDamagePerUpdate;                                // 0x07F0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData25[0x4];                                       // 0x07F4(0x0004) MISSED OFFSET
	class UInventoryContainer2D*                       _inventoryContainer2D;                                    // 0x07F8(0x0008) (BlueprintVisible, ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FItemLayout                                 _itemLayout;                                              // 0x0800(0x0040) (Edit, DisableEditOnInstance, DuplicateTransient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.Item");
		return ptr;
	}


	bool Use(class APrisoner* Prisoner, int usage, float usageWeight, bool Eat, float damageMultiplier);
	void UpdateVisuals(bool shouldHandleAging);
	void UpdateDebugText();
	void StopBlinking();
	void StaticMeshChangedDelegate__DelegateSignature(class AItem* Item);
	void SkeletalMeshChangedDelegate__DelegateSignature(class AItem* Item);
	void SetWeight(float Value);
	void SetMaxHealth(float maxHealth);
	void SetHealth(float health);
	void SetFuel(float Value);
	void Server_Throw(const struct FVector& ZeroBasedStartPosition, const struct FRotator& StartRotation, const struct FVector& StartVelocity);
	void SelectedEvent__DelegateSignature(bool selected);
	void Repair(float healthToRepair);
	TScriptInterface<class UInventoryNode> RemoveStacks(int stacksToSplit);
	void PickedUpStateDelegate__DelegateSignature(class AItem* Item, bool pickedUp);
	void PhysicsSimulationTimerCallback();
	void OnRightClicked();
	void OnRep_WeightUsed();
	void OnRep_WaterWeight();
	void OnRep_Visibility();
	void OnRep_Stacks();
	void OnRep_MeshIsSimulatingPhysics();
	void OnRep_InventoryContainer2D();
	void OnRep_Health();
	void OnRep_Examined();
	void OnRep_DebugText();
	void OnProjectileStop(const struct FHitResult& ImpactResult);
	void OnLocalPrisonerPanelsClosed();
	void OnLocalPrisonerHoveredActorChanged(class AActor* hoveredActor);
	void OnEditTextWidgetTextAccepted(class APrisoner* User, const struct FText& Text);
	void OnDetachedFromItem(class AItem* Item);
	void OnDestroyedEvent(class AActor* Self);
	void OnContainedItemDestroyed(class AActor* containedItem);
	void OnAttachedToItem(class AItem* Item);
	void NetMulticast_SpawnDestroyedEffects();
	void NetMulticast_SetPlayerGivenName(const struct FString& Value);
	void NetMulticast_SetActorDropLocationAndRotation(const struct FVector& Location, const struct FRotator& Rotation);
	void Multicast_UpdateExpirationTime(int64_t Time);
	void Multicast_Throw(const struct FVector& ZeroBasedStartPosition, const struct FRotator& StartRotation, const struct FVector& StartVelocity);
	void ItemRemovedDelegate__DelegateSignature(class AItem* container, class AItem* Item);
	void ItemMovedDelegate__DelegateSignature(class AItem* container, class AItem* Item, int column, int row);
	void ItemAddedDelegate__DelegateSignature(class AItem* container, class AItem* Item, int column, int row);
	bool HasPriorityForContainerItem(class AItem* containerItem);
	struct FWidgetDisplayInfo GetWidgetDisplayInfo();
	float GetWetness();
	float GetWeightUsed();
	float GetWeightRemained();
	float GetWeightPerUse();
	float GetWeight();
	float GetWaterWeight();
	int GetUsedSlots();
	float GetUsedMass();
	float GetTotalWeight();
	int GetTotalUses();
	int GetStacksCount();
	int GetSizeY();
	int GetSizeX();
	int GetRemainingUses();
	int GetRemaining();
	float GetNormalizedHealth();
	float GetNoiseLoudnessWhenPickedUp();
	float GetNoiseLoudnessWhenDropped();
	float GetNoiseLoudnessOnGroundImpact();
	class UMeshComponent* GetMeshComponent();
	float GetMaxHealth();
	float GetHealth();
	float GetFuel();
	float GetDefaultMaxHealth();
	void GetDebugText(struct FText* debugText);
	TArray<class AItem*> GetAllContainedItems(bool recursive);
	bool DropAt(const struct FVector& dropLocation, const struct FRotator& dropRotation);
	bool DropAround(class AActor* Actor, float Radius);
	void Drop(bool wasThrowed);
	void DetachFromAll();
	void DebugTextChangedDelegate__DelegateSignature(class AItem* Item);
	bool CanStackWith(const TScriptInterface<class UInventoryNode>& Item);
	bool CanStack();
	bool CanBeDroppedBy(class AConZCharacter* Character);
	bool CanBeCraftedByCharactrer(class ACharacter* Character);
	bool CanAutoAddItem(class AItem* Item, unsigned char* column, unsigned char* row);
	bool CanAddItem(class AItem* Item, unsigned char column, unsigned char row);
	void Blink(float Duration);
	bool AutoAddItemToInventoryNode(const TScriptInterface<class UInventoryNode>& Item);
	bool AttachToCharacterHands(class AConZCharacter* Character);
	void AddStack(const TScriptInterface<class UInventoryNode>& Item);
};


// Class ConZ.AmmunitionItem
// 0x0018 (0x0858 - 0x0840)
class AAmmunitionItem : public AItem
{
public:
	class UClass*                                      ProjectileClass;                                          // 0x0840(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxAmmoCount;                                             // 0x0848(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                _ammoCount;                                               // 0x084C(0x0004) (Edit, Net, ZeroConstructor, IsPlainOldData)
	int                                                _ammoCountOwnerHelper;                                    // 0x0850(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0854(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AmmunitionItem");
		return ptr;
	}


	void SetAmmoCount(int count, bool replicateToOwner);
	void OnRep_AmmoCountOwnerHelper();
	void OnRep_AmmoCount();
	int GetAmmoCount();
	void Client_SetAmmoCount(int count);
};


// Class ConZ.AmmunitionArrow
// 0x0020 (0x0878 - 0x0858)
class AAmmunitionArrow : public AAmmunitionItem
{
public:
	bool                                               DestroyOnHit;                                             // 0x0858(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0859(0x0007) MISSED OFFSET
	class UClass*                                      BrokenArrowClass;                                         // 0x0860(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              _muzzleVelocityMultiplier;                                // 0x0868(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              _stiffnessFactor;                                         // 0x086C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              _flightRotationCorrectionSpeed;                           // 0x0870(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              _elasticityFactorSpread;                                  // 0x0874(0x0004) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AmmunitionArrow");
		return ptr;
	}

};


// Class ConZ.AmmunitionBoxItem
// 0x0018 (0x0858 - 0x0840)
class AAmmunitionBoxItem : public AItem
{
public:
	class UClass*                                      AmmunitionItemClass;                                      // 0x0840(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      ItemClassToSpawnWhenUnpacked;                             // 0x0848(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxAmmoCount;                                             // 0x0850(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                _ammoCount;                                               // 0x0854(0x0004) (Edit, Net, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AmmunitionBoxItem");
		return ptr;
	}


	void OnRep_AmmoCount();
};


// Class ConZ.ConZCharacter
// 0x0200 (0x0940 - 0x0740)
class AConZCharacter : public ACharacter
{
public:
