#pragma once

// SCUM (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class ConZ.AchievementsManagerClient
// 0x0098 (0x03C0 - 0x0328)
class AAchievementsManagerClient : public AActor
{
public:
	unsigned char                                      UnknownData00[0x98];                                      // 0x0328(0x0098) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AchievementsManagerClient");
		return ptr;
	}

};


// Class ConZ.AchievementsManagerServer
// 0x0078 (0x03A0 - 0x0328)
class AAchievementsManagerServer : public AActor
{
public:
	unsigned char                                      UnknownData00[0x78];                                      // 0x0328(0x0078) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AchievementsManagerServer");
		return ptr;
	}

};


// Class ConZ.DesignableUserWidget
// 0x0018 (0x0220 - 0x0208)
class UDesignableUserWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0208(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.DesignableUserWidget");
		return ptr;
	}


	void SetDisplayLabelName(const struct FString& displayLabelName);
	void SetDefaultPosition(const struct FVector2D& Value);
	void OnSynchronizeProperties();
	struct FString GetDisplayLabelName();
	struct FVector2D GetDefaultPosition();
};


// Class ConZ.ActionProgressWidget
// 0x0050 (0x0270 - 0x0220)
class UActionProgressWidget : public UDesignableUserWidget
{
public:
	struct FScriptMulticastDelegate                    ActionProgressFinishedEvent;                              // 0x0220(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    ActionProgressCancelledEvent;                             // 0x0230(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               CanCancel;                                                // 0x0240(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xB];                                       // 0x0241(0x000B) MISSED OFFSET
	float                                              _currentTime;                                             // 0x024C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              _duration;                                                // 0x0250(0x0004) (Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               _manualMode;                                              // 0x0254(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1B];                                      // 0x0255(0x001B) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.ActionProgressWidget");
		return ptr;
	}


	void SetProgress(float progress);
	void OnActionProgressFinishedEvent__DelegateSignature();
	void OnActionProgressCancelledEvent__DelegateSignature();
	void ExecuteAction();
	void CancelAction();
};


// Class ConZ.Sickness
// 0x0188 (0x01B0 - 0x0028)
class USickness : public UObject
{
public:
	unsigned char                                      UnknownData00[0x188];                                     // 0x0028(0x0188) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.Sickness");
		return ptr;
	}


	void SetShouldDisplayState(bool Value);
	ESicknessState GetState();
	bool GetShouldDisplayState();
	int GetPhase();
	struct FText GetCaption();
};


// Class ConZ.Addiction
// 0x0000 (0x01B0 - 0x01B0)
class UAddiction : public USickness
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.Addiction");
		return ptr;
	}

};


// Class ConZ.AlcoholismAddiction
// 0x0010 (0x01C0 - 0x01B0)
class UAlcoholismAddiction : public UAddiction
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x01B0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AlcoholismAddiction");
		return ptr;
	}

};


// Class ConZ.Disease
// 0x0000 (0x01B0 - 0x01B0)
class UDisease : public USickness
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.Disease");
		return ptr;
	}

};


// Class ConZ.Poisoning
// 0x0000 (0x01B0 - 0x01B0)
class UPoisoning : public UDisease
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.Poisoning");
		return ptr;
	}

};


// Class ConZ.AmanitaMuscariaPoisoning
// 0x0010 (0x01C0 - 0x01B0)
class UAmanitaMuscariaPoisoning : public UPoisoning
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x01B0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AmanitaMuscariaPoisoning");
		return ptr;
	}

};


// Class ConZ.AmanitaPantheriaPoisoning
// 0x0008 (0x01B8 - 0x01B0)
class UAmanitaPantheriaPoisoning : public UPoisoning
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01B0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AmanitaPantheriaPoisoning");
		return ptr;
	}

};


// Class ConZ.AmanitaPhalloidesPoisoning
// 0x0008 (0x01B8 - 0x01B0)
class UAmanitaPhalloidesPoisoning : public UPoisoning
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01B0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AmanitaPhalloidesPoisoning");
		return ptr;
	}

};


// Class ConZ.AmanitaVirosaPoisoning
// 0x0010 (0x01C0 - 0x01B0)
class UAmanitaVirosaPoisoning : public UPoisoning
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x01B0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AmanitaVirosaPoisoning");
		return ptr;
	}

};


// Class ConZ.Item
// 0x04B8 (0x07E0 - 0x0328)
class AItem : public AActor
{
public:
	unsigned char                                      UnknownData00[0x80];                                      // 0x0328(0x0080) MISSED OFFSET
	struct FScriptMulticastDelegate                    DebugTextChanged;                                         // 0x03A8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    PickedUpState;                                            // 0x03B8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnStaticMeshChanged;                                      // 0x03C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnSkeletalMeshChanged;                                    // 0x03D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnItemAddedEvent;                                         // 0x03E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnItemRemovedEvent;                                       // 0x03F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnItemMovedEvent;                                         // 0x0408(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0418(0x0010) MISSED OFFSET
	class UClass*                                      AttachmentSocketMountType;                                // 0x0428(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FAttachmentSocket>                   AttachmentSockets;                                        // 0x0430(0x0010) (Edit, ZeroConstructor)
	class UClass*                                      HolsterAttachmentSocketMountType;                         // 0x0440(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TMap<class UClass*, struct FAttachmentSocketOffset> AttachmentSocketsOffset;                                  // 0x0448(0x0050) (Edit, ZeroConstructor)
	class UStaticMeshComponent*                        Mesh;                                                     // 0x0498(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UTexture2D*                                  InventoryIcon;                                            // 0x04A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UTexture2D*                                  InventoryIconInHands;                                     // 0x04A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FText                                       Caption;                                                  // 0x04B0(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	uint32_t                                           SizeX;                                                    // 0x04C8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	uint32_t                                           SizeY;                                                    // 0x04CC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               IgnoreMaxContainedWeight;                                 // 0x04D0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x04D1(0x0003) MISSED OFFSET
	float                                              MaxContainedWeight;                                       // 0x04D4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MaxWaterWeightAsRatioOfWeight;                            // 0x04D8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsIgnoredBySpawners;                                      // 0x04DC(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FItemLocation                               ItemLocation;                                             // 0x04DD(0x000C) (Edit, DisableEditOnInstance)
	EItemRarity                                        Rarity;                                                   // 0x04E9(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x6];                                       // 0x04EA(0x0006) MISSED OFFSET
	struct FGameplayTagContainer                       ItemSpawnTypes;                                           // 0x04F0(0x0020) (Edit, DisableEditOnInstance)
	struct FVector                                     SpawnLocationOffset;                                      // 0x0510(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    SpawnRotationOffset;                                      // 0x051C(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              SpawnRotationRandomization;                               // 0x0528(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                Uses;                                                     // 0x052C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FText                                       Description;                                              // 0x0530(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<struct FPossibleItemSickness>               PossibleSicknesses;                                       // 0x0548(0x0010) (Edit, ZeroConstructor)
	TArray<class UClass*>                              TreatSicknesses;                                          // 0x0558(0x0010) (Edit, ZeroConstructor)
	float                                              DamageOnUse;                                              // 0x0568(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DamageOverTime;                                           // 0x056C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AutoDestructTime;                                         // 0x0570(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	EItemExhausted                                     IfExhausted;                                              // 0x0574(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	EInteractionType                                   CraftingInteraction;                                      // 0x0575(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x2];                                       // 0x0576(0x0002) MISSED OFFSET
	class UChoppingRecipeDataAsset*                    ChoppingRecipeDataAsset;                                  // 0x0578(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FText                                       PickupCaption;                                            // 0x0580(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               EnableGlowOnBeginPlay;                                    // 0x0598(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               EnableAwarenessGlow;                                      // 0x0599(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               EnableHoverGlow;                                          // 0x059A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x5];                                       // 0x059B(0x0005) MISSED OFFSET
	TArray<class UBaseItemTag*>                        ItemTags;                                                 // 0x05A0(0x0010) (Edit, ZeroConstructor)
	TArray<class UBaseItemTag*>                        OwnedItemTags;                                            // 0x05B0(0x0010) (Edit, ExportObject, ZeroConstructor)
	TArray<struct FString>                             ItemSnapTags;                                             // 0x05C0(0x0010) (Edit, ZeroConstructor)
	EItemNoiseLevel                                    NoiseLevel;                                               // 0x05D0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x7];                                       // 0x05D1(0x0007) MISSED OFFSET
	struct FItemMotionNoise                            MotionNoise;                                              // 0x05D8(0x0008) (Edit)
	struct FItemInventoryHandlingSounds                InventoryHandlingSounds;                                  // 0x05E0(0x0008) (Edit)
	class UDestructibleMesh*                           DestroyedMesh;                                            // 0x05E8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DestroyedImpulseStrength;                                 // 0x05F0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x05F4(0x0004) MISSED OFFSET
	class UAkAudioEvent*                               DestroyedSound;                                           // 0x05F8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      HoverWidgetClass;                                         // 0x0600(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x50];                                      // 0x0608(0x0050) MISSED OFFSET
	class UThrowingComponent*                          ThrowingComponent;                                        // 0x0658(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               ShouldDestroyContainedItemsOnDestroyEvent;                // 0x0660(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x49];                                      // 0x0661(0x0049) MISSED OFFSET
	EInteractionType                                   _defaultInteractionOnFloor;                               // 0x06AA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EInteractionType                                   _defaultInteractionInInventory;                           // 0x06AB(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EInteractionType                                   _defaultInteractionEquipped;                              // 0x06AC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10[0x17];                                      // 0x06AD(0x0017) MISSED OFFSET
	float                                              _itemLoadingWeightOverride;                               // 0x06C4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FText                                       _debugText;                                               // 0x06C8(0x0018) (Net)
	class AActor*                                      _attachParentObject;                                      // 0x06E0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FVisibilityReplication                      _visibilityReplication;                                   // 0x06E8(0x0008) (Net)
	unsigned char                                      UnknownData11[0x14];                                      // 0x06F0(0x0014) MISSED OFFSET
	unsigned char                                      _waterWeightReplicated;                                   // 0x0704(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData12[0xB];                                       // 0x0705(0x000B) MISSED OFFSET
	bool                                               _meshIsSimulatingPhysics;                                 // 0x0710(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData13[0x3];                                       // 0x0711(0x0003) MISSED OFFSET
	float                                              Fuel;                                                     // 0x0714(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Weight;                                                   // 0x0718(0x0004) (Edit, Net, ZeroConstructor, IsPlainOldData)
	float                                              _damage;                                                  // 0x071C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      _damageReplicated;                                        // 0x0720(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData14[0x3];                                       // 0x0721(0x0003) MISSED OFFSET
	float                                              _weightUsed;                                              // 0x0724(0x0004) (Edit, Net, ZeroConstructor, IsPlainOldData)
	bool                                               _isCrafted;                                               // 0x0728(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData15[0x3];                                       // 0x0729(0x0003) MISSED OFFSET
	float                                              _uncraftTime;                                             // 0x072C(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               _isBusy;                                                  // 0x0730(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               _examined;                                                // 0x0731(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData16[0x16];                                      // 0x0732(0x0016) MISSED OFFSET
	class USceneComponent*                             _tempSceneComponent;                                      // 0x0748(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	bool                                               _useHandCorrections;                                      // 0x0750(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               _shouldBeMaintained;                                      // 0x0751(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData17[0xE];                                       // 0x0752(0x000E) MISSED OFFSET
	int64_t                                            _expirationTime;                                          // 0x0760(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               _canBeDropped;                                            // 0x0768(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData18[0x3];                                       // 0x0769(0x0003) MISSED OFFSET
	int                                                _maxNumberOfContainedItems;                               // 0x076C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               _canContainNonEmptyItems;                                 // 0x0770(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               _blinkOnSpawn;                                            // 0x0771(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               _isPartOfEvent;                                           // 0x0772(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData19[0x1];                                       // 0x0773(0x0001) MISSED OFFSET
	float                                              _vicinityCheckDistance;                                   // 0x0774(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              _updateVisualsFrequency;                                  // 0x0778(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData20[0x4];                                       // 0x077C(0x0004) MISSED OFFSET
	struct FTimerHandle                                _updateVisualsTimer;                                      // 0x0780(0x0008)
	TArray<struct FInventoryStackData>                 _stacks;                                                  // 0x0788(0x0010) (Net, ZeroConstructor)
	TArray<class UClass*>                              _stackableClasses;                                        // 0x0798(0x0010) (Edit, ZeroConstructor)
	class AItem*                                       _stackExhaustedSuccessorItem;                             // 0x07A8(0x0008) (ZeroConstructor, IsPlainOldData)
	TScriptInterface<class UInventoryContainer>        _parentContainer;                                         // 0x07B0(0x0010) (ZeroConstructor, IsPlainOldData)
	TScriptInterface<class UInventoryNode>             _parentInventoryNode;                                     // 0x07C0(0x0010) (ZeroConstructor, IsPlainOldData)
	bool                                               _canEverBeVirtualized;                                    // 0x07D0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               _hasHighLoadPriorityInVirtualization;                     // 0x07D1(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               _canPlaceItemsOn;                                         // 0x07D2(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData21[0x5];                                       // 0x07D3(0x0005) MISSED OFFSET
	class UInventoryContainer2D*                       _inventoryContainer2D;                                    // 0x07D8(0x0008) (BlueprintVisible, ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.Item");
		return ptr;
	}


	bool Use(class APrisoner* Prisoner, int usage, float usageWeight, bool Eat);
	void UpdateVisuals(bool shouldHandleAging);
	void UpdateDebugText();
	void StopBlinking();
	void StaticMeshChangedDelegate__DelegateSignature(class AItem* Item);
	void SkeletalMeshChangedDelegate__DelegateSignature(class AItem* Item);
	void SetWeight(float Value);
	void SetFuel(float Value);
	void SetDamage(float Damage);
	void Server_Throw(const struct FVector& ZeroBasedStartPosition, const struct FRotator& StartRotation, const struct FVector& StartVelocity);
	void SelectedEvent__DelegateSignature(bool selected);
	TScriptInterface<class UInventoryNode> RemoveStacks(int stacksToSplit);
	void PickedUpStateDelegate__DelegateSignature(class AItem* Item, bool pickedUp);
	void PhysicsSimulationTimerCallback();
	void OnRightClicked();
	void OnRep_WeightUsed();
	void OnRep_WaterWeight();
	void OnRep_Visibility();
	void OnRep_Stacks();
	void OnRep_MeshIsSimulatingPhysics();
	void OnRep_InventoryContainer2D();
	void OnRep_Examined();
	void OnRep_DebugText();
	void OnRep_Damage();
	void OnProjectileStop(const struct FHitResult& ImpactResult);
	void OnDetachedFromItem(class AItem* Item);
	void OnDestroyedEvent(class AActor* Self);
	void OnContainedItemDestroyed(class AActor* containedItem);
	void OnAttachedToItem(class AItem* Item);
	void NetMulticast_SpawnDestroyedEffects();
	void NetMulticast_SetActorDropLocationAndRotation(const struct FVector& Location, const struct FRotator& Rotation);
	bool NeedServerDataUpdate();
	void Multicast_UpdateExpirationTime(int64_t Time);
	void Multicast_Throw(const struct FVector& ZeroBasedStartPosition, const struct FRotator& StartRotation, const struct FVector& StartVelocity);
	void ItemRemovedDelegate__DelegateSignature(class AItem* container, class AItem* Item);
	void ItemMovedDelegate__DelegateSignature(class AItem* container, class AItem* Item, int column, int row);
	void ItemAddedDelegate__DelegateSignature(class AItem* container, class AItem* Item, int column, int row);
	void Interact(class APrisoner* user, EInteractionType InteractionType, const struct FInteractionData& InteractionData);
	bool HasPriorityForContainerItem(class AItem* containerItem);
	struct FWidgetDisplayInfo GetWidgetDisplayInfo();
	float GetWetness();
	float GetWeightUsed();
	float GetWeightRemained();
	float GetWeightPerUse();
	float GetWeight();
	float GetWaterWeight();
	int GetUsedSlots();
	float GetUsedMass();
	float GetTotalWeight();
	int GetTotalUses();
	int GetStacksCount();
	int GetSlotsCount();
	int GetSizeY();
	int GetSizeX();
	int GetRemainingUses();
	int GetRemaining();
	float GetNoiseLoudnessWhenPickedUp();
	float GetNoiseLoudnessWhenDropped();
	float GetNoiseLoudnessOnGroundImpact();
	class UMeshComponent* GetMeshComponent();
	TArray<struct FInteractionStruct> GetInteractions(class UObject* user, class UObject* creator, const struct FInteractionQueryParameters& params);
	float GetFuel();
	void GetDebugText(struct FText* debugText);
	float GetDamage(bool recalculate);
	TArray<class AItem*> GetAllContainedItems();
	bool DropAt(const struct FVector& dropLocation, const struct FRotator& dropRotation);
	bool DropAround(class AActor* Actor, float Radius);
	void Drop(bool wasThrowed);
	void DetachFromAll();
	void DebugTextChangedDelegate__DelegateSignature(class AItem* Item);
	bool CanStackWith(const TScriptInterface<class UInventoryNode>& Item);
	bool CanStack();
	bool CanInteract(class APrisoner* user);
	bool CanBeEverDropped();
	bool CanBeDroppedBy(class AConZCharacter* Character);
	bool CanBeCraftedByCharactrer(class ACharacter* Character);
	bool CanAutoAddItem(class AItem* Item, unsigned char* column, unsigned char* row);
	bool CanAddItem(class AItem* Item, unsigned char column, unsigned char row);
	void Blink(float Duration);
	bool AutoAddItemToInventoryNode(const TScriptInterface<class UInventoryNode>& Item);
	bool AttachToCharacterHands(class AConZCharacter* Character);
	void AddStack(const TScriptInterface<class UInventoryNode>& Item);
};


// Class ConZ.AmmunitionItem
// 0x0010 (0x07F0 - 0x07E0)
class AAmmunitionItem : public AItem
{
public:
	class UClass*                                      projectileClass;                                          // 0x07E0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxAmmoCount;                                             // 0x07E8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                _ammoCount;                                               // 0x07EC(0x0004) (Edit, Net, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AmmunitionItem");
		return ptr;
	}


	void SetAmmoCount(int count);
	void OnRep_AmmoCount();
	int GetAmmoCount();
};


// Class ConZ.AmmunitionArrow
// 0x0020 (0x0810 - 0x07F0)
class AAmmunitionArrow : public AAmmunitionItem
{
public:
	bool                                               DestroyOnHit;                                             // 0x07F0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x07F1(0x0007) MISSED OFFSET
	class UClass*                                      BrokenArrowClass;                                         // 0x07F8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              _muzzleVelocityMultiplier;                                // 0x0800(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              _stiffnessFactor;                                         // 0x0804(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              _flightRotationCorrectionSpeed;                           // 0x0808(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              _elasticityFactorSpread;                                  // 0x080C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AmmunitionArrow");
		return ptr;
	}

};


// Class ConZ.AmmunitionBoxItem
// 0x0018 (0x07F8 - 0x07E0)
class AAmmunitionBoxItem : public AItem
{
public:
	class UClass*                                      AmmunitionItemClass;                                      // 0x07E0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      ItemClassToSpawnWhenUnpacked;                             // 0x07E8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxAmmoCount;                                             // 0x07F0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                _ammoCount;                                               // 0x07F4(0x0004) (Edit, Net, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AmmunitionBoxItem");
		return ptr;
	}


	void OnRep_AmmoCount();
};


// Class ConZ.ItemSpawner
// 0x0080 (0x03A8 - 0x0328)
class AItemSpawner : public AActor
{
public:
	class UClass*                                      ItemClassToSpawn;                                         // 0x0328(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               UseItemSpawnTypeTags;                                     // 0x0330(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0331(0x0007) MISSED OFFSET
	struct FGameplayTagContainer                       ItemSpawnTypes;                                           // 0x0338(0x0020) (Edit)
	float                                              Probability;                                              // 0x0358(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               UseItemLimit;                                             // 0x035C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               UseItemZone;                                              // 0x035D(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               UseItemRarity;                                            // 0x035E(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x035F(0x0001) MISSED OFFSET
	float                                              InitialDamage;                                            // 0x0360(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RandomizeDamage;                                          // 0x0364(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              InitialUsage;                                             // 0x0368(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RandomizeUsage;                                           // 0x036C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              InitialDirtiness;                                         // 0x0370(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RandomizeDirtiness;                                       // 0x0374(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FPossibleItemSickness>               PossibleSicknesses;                                       // 0x0378(0x0010) (Edit, ZeroConstructor)
	class USceneComponent*                             SceneComponent;                                           // 0x0388(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x18];                                      // 0x0390(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.ItemSpawner");
		return ptr;
	}

};


// Class ConZ.AmmunitionItemSpawner
// 0x0020 (0x03C8 - 0x03A8)
class AAmmunitionItemSpawner : public AItemSpawner
{
public:
	TArray<class UClass*>                              Items;                                                    // 0x03A8(0x0010) (Edit, ZeroConstructor)
	TArray<class UItemGroup*>                          ItemGroups;                                               // 0x03B8(0x0010) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.AmmunitionItemSpawner");
		return ptr;
	}

};


// Class ConZ.ConZCharacter
// 0x01F0 (0x0930 - 0x0740)
class AConZCharacter : public ACharacter
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0740(0x0030) MISSED OFFSET
	class UClass*                                      CorpseClass;                                              // 0x0770(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UChoppingRecipeDataAsset*                    ChoppingRecipeDataAsset;                                  // 0x0778(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IterativeChopping;                                        // 0x0780(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0781(0x0007) MISSED OFFSET
	struct FName                                       HeadBoneName;                                             // 0x0788(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TMap<struct FName, EBodyPart>                      BodyPartByBoneName;                                       // 0x0790(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData02[0x1];                                       // 0x07E0(0x0001) MISSED OFFSET
	bool                                               ShouldAutoUpdateEnvironmentDescription;                   // 0x07E1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x07E2(0x0002) MISSED OFFSET
	float                                              EnvironmentDescriptionAutoUpdateInterval;                 // 0x07E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAkAudioEvent*                               EnteredIndoorEnvironmentAudioEvent;                       // 0x07E8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAkAudioEvent*                               EnteredOutdoorEnvironmentAudioEvent;                      // 0x07F0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAkAudioEvent*                               EnteredUndergroundAudioEvent;                             // 0x07F8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAkAudioEvent*                               LeftUndergroundAudioEvent;                                // 0x0800(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ProjectileHitXpModifier;                                  // 0x0808(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ProjectileHitXpModifierInEvent;                           // 0x080C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x8];                                       // 0x0810(0x0008) MISSED OFFSET
	class UCharacterSoundComponent*                    SoundComponent;                                           // 0x0818(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData05[0x20];                                      // 0x0820(0x0020) MISSED OFFSET
	EGender                                            _gender;                                                  // 0x0840(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x1F];                                      // 0x0841(0x001F) MISSED OFFSET
	EConZPxDominanceGroup                              _physicsDominanceGroup;                                   // 0x0860(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x0861(0x0003) MISSED OFFSET
	float                                              _activeHitTimeToLive;                                     // 0x0864(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 _hitDamageVsVehicleSpeedInKph;                            // 0x0868(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FHitEffects                                 _effectsOnVehicleHit[0x3];                                // 0x0870(0x0038) (Edit)
	unsigned char                                      UnknownData08[0x10];                                      // 0x0918(0x0010) MISSED OFFSET
	EAITeam                                            _aiTeam;                                                  // 0x0928(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x7];                                       // 0x0929(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.ConZCharacter");
		return ptr;
	}


	void SetGender(EGender Value);
	void SetEnvironmentDescription(const struct FEnvironmentDescription& Value);
	void Server_HandleMeleeAttackCapsuleHit(class AConZCharacter* attacker, const struct FMeleeAttackCapsuleHitInfo& HitInfo);
	void ReceiveBeginHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool selfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnRep_Gender();
	void NetMulticast_HandleMeleeAttackCapsuleHit(class AConZCharacter* attacker, const struct FMeleeAttackCapsuleHitInfo& HitInfo);
	class ACorpse* LeaveCorpse();
	bool IsHeadBone(const struct FName& BoneName);
	bool IsConscious();
	bool IsAlive();
	class UCharacterSoundComponent* GetSoundComponent();
	EDetectHitCollisionType GetHitReactBodyPartFromHitResult(const struct FHitResult& HitResult);
	EDetectHitCollisionType GetHitReactBodyPartFromBodyPart(EBodyPart Value);
	EGender GetGender();
	struct FEnvironmentDescription GetEnvironmentDescription();
	EBodyPart GetBodyPartFromBoneName(const struct FName& BoneName);
	void ActorHitCallback(class AActor* Actor, class AActor* OtherActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
};


// Class ConZ.Animal
// 0x01B0 (0x0AE0 - 0x0930)
class AAnimal : public AConZCharacter
{
public:
	struct FText                                       Species;                                                  // 0x0930(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	float                                              AttackRange;                                              // 0x0948(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              SightRange;                                               // 0x094C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              SenseRange;                                               // 0x0950(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              HitAngle;                                                 // 0x0954(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              HitRange;                                                 // 0x0958(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              WalkSpeed;                                                // 0x095C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RunSpeed;                                                 // 0x0960(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AttackSpeed;                                              // 0x0964(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RotationSpeedFree;                                        // 0x0968(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RotationSpeedFollow;                                      // 0x096C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              StuckTime;                                                // 0x0970(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              StuckRadius;                                              // 0x0974(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              StuckDuration;                                            // 0x0978(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Mass;                                                     // 0x097C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MeleeDamageMultiplier;                                    // 0x0980(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              BodyShotDamageMultiplier;                                 // 0x0984(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              HeadShotDamageMultiplier;                                 // 0x0988(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              BleedingSpeed;                                            // 0x098C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              BleedingThreshold;                                        // 0x0990(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EAnimalHandlingLevel                               HandlingLevel;                                            // 0x0994(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0995(0x0003) MISSED OFFSET
	TArray<EAnimalCommand>                             HandlingCommands;                                         // 0x0998(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimalHandlingItemTag*                      HandlingTag;                                              // 0x09A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TickFrequency;                                            // 0x09B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      IdleStates;                                               // 0x09B4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x09B5(0x0003) MISSED OFFSET
	float                                              EatingProbability;                                        // 0x09B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ObservingProbability;                                     // 0x09BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              GroundSlopeAngleSmoothingRate;                            // 0x09C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x09C4(0x0004) MISSED OFFSET
	class UClass*                                      TrackingMarker;                                           // 0x09C8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      BloodTrailMarker;                                         // 0x09D0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TrackingMarkerFrequency;                                  // 0x09D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TrackingMarkerDistance;                                   // 0x09DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TrackingMarkerRadius;                                     // 0x09E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TrackingMarkerDuration;                                   // 0x09E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinDistanceFromHabitatWhenSearchingForFood;               // 0x09E8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxDistanceFromHabitatWhenSearchingForFood;               // 0x09EC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinRestDuration;                                          // 0x09F0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxRestDuration;                                          // 0x09F4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinDesiredFleeLocationDistance;                           // 0x09F8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxDesiredFleeLocationDistance;                           // 0x09FC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              GoalRadius;                                               // 0x0A00(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinFleeingDuration;                                       // 0x0A04(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxFleeingDuration;                                       // 0x0A08(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FleeingDirectionRandomness;                               // 0x0A0C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class AActor*                                      Habitat;                                                  // 0x0A10(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinIdleTime;                                              // 0x0A18(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxIdleTime;                                              // 0x0A1C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UAnimMontage*                                EatingAnimMontage;                                        // 0x0A20(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UAnimMontage*                                ObservingAnimMontage;                                     // 0x0A28(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               DebugDraw;                                                // 0x0A30(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0A31(0x0003) MISSED OFFSET
	struct FColor                                      DebugColor;                                               // 0x0A34(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	class UAnimalAnimationComponent*                   AnimationComponent;                                       // 0x0A38(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UHitReactComponent*                          HitReactComponent;                                        // 0x0A40(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UTextRenderComponent*                        NameTextRender;                                           // 0x0A48(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData04[0x8];                                       // 0x0A50(0x0008) MISSED OFFSET
	float                                              _health;                                                  // 0x0A58(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	EAnimalPace                                        _pace;                                                    // 0x0A5C(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x13];                                      // 0x0A5D(0x0013) MISSED OFFSET
	class APrisoner*                                   _handler;                                                 // 0x0A70(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	EAnimalHandlingStage                               _handlingStage;                                           // 0x0A78(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	EAnimalCommand                                     _handlingCommand;                                         // 0x0A79(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x6];                                       // 0x0A7A(0x0006) MISSED OFFSET
	struct FString                                     _realName;                                                // 0x0A80(0x0010) (Net, ZeroConstructor)
	int                                                _handlingID;                                              // 0x0A90(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x18];                                      // 0x0A94(0x0018) MISSED OFFSET
	unsigned char                                      _idleState;                                               // 0x0AAC(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x33];                                      // 0x0AAD(0x0033) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ConZ.Animal");
		return ptr;
	}


	void TestTameAnimal(class APrisoner* Prisoner);
	void StopObservingMontageOnClients();
	void StopEatingMontageOnClients();
	void SilentKill();
	void SetRealNameOnClient(const struct FString& realName);
	void SetPace(EAnimalPace pace);
	void PlayObservingMontageOnClients();
	void PlayEatingMontageOnClients();
	void OnShot(const struct FHitResult& HitResult, const struct FVector& ImpulseDir);
	void OnRep_RealName();
	void OnRagdollShot(const struct FHitResult& HitResult, const struct FVector& ImpulseDir);
	void Kill();
	void GoToRagdoll();
	float GetSpeed();
	EAnimalPace GetPace();
	EAnimalCommand GetHandlingCommand();
	void ApplyDamage(float Damage);
};


// Class ConZ.Animal2
// 0x01B0 (0x0AE0 - 0x0930)
class AAnimal2 : public AConZCharacter
{
public:
	struct FText                                       Species;                                                  // 0x0930(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	EAnimalActivityCycle                               ActivityCycle;                                            // 0x0948(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0949(0x0003) MISSED OFFSET
	float                                              MaxHealth;                                                // 0x094C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UHitReactComponent*                          HitReactComponent;                                        // 0x0950(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	struct FGameplayTag                                HitReactType;                                             // 0x0958(0x0008) (Edit, BlueprintVisible)
	struct FName                                       EyesViewPointSocketName;                                  // 0x0960(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UClass*                                      TrackingMarker;                                           // 0x0968(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      BloodTrailMarker;                                         // 0x0970(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TrackingMarkerFrequency;                                  // 0x0978(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TrackingMarkerDistance;                                   // 0x097C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TrackingMarkerRadius;                                     // 0x0980(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TrackingMarkerDuration;                                   // 0x0984(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              BleedingSpeed;                                            // 0x0988(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LightWoundDamageAmount;                                   // 0x098C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
